Documents/ПереоценкаНеустановленногоОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ПереоценкаНеустановленногоОборудования</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьПоБУ</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписыватьЦеныВСправочник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПереоценка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПереоценкаНеустановленногоОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПереоценки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьНовая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентПереоценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазницаПоПереоценке</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоступления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаБУ</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтараяЦена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПериодыИКоэффициенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НачалоПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПереоценкаНеустановленногоОборудования/Ext/ObjectModule.bsl
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ДобавитьПрефиксУзла(Префикс);
	
КонецПроцедуры

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("Печать","Печать");
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Заголовок = ПредставлениеДокументаПриПроведении(Ссылка);
	
	СтруктураШапкиДокумента = СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	
	Если ЗаписыватьЦеныВСправочник Тогда
		
		ЗаписатьЦеныВСправочник();
		
	КонецЕсли; 
	
	ДвиженияПоБУ(Режим, Отказ, Заголовок,СтруктураШапкиДокумента);
	
КонецПроцедуры

Процедура ЗаписатьЦеныВСправочник()
	
	Для каждого Строка Из Оборудование Цикл
		
		Если Строка.РазницаПоПереоценке=0 Тогда
			
			Продолжить;
			
		КонецЕсли; 
		
		НоваяЦена=0;
		
		Если Строка.Количество<>0 Тогда
			
			НоваяЦена=окр(Строка.СтоимостьНовая/Строка.Количество,2);
			
		КонецЕсли; 
		
		НоменклатураОбъект= Строка.Номенклатура.ПолучитьОбъект();
		НоменклатураОбъект.Цена=НоваяЦена;
		НоменклатураОбъект.Записать();
		
	КонецЦикла; 				

КонецПроцедуры
 

Процедура ДвиженияПоБУ(Режим, Отказ, Заголовок,СтруктураШапкиДокумента)
	
	Для Каждого Строка Из Оборудование Цикл
		
		Если Строка.РазницаПоПереоценке <> 0 Тогда
			
			Проводка = Движения.Хозрасчетный.Добавить();
			
			Проводка.Период       = Дата;
			Проводка.Активность   = Истина;
			Проводка.Организация  = Организация;
			Проводка.Содержание   = "";
			//Проводка.НомерЖурнала = НомерЖурнала;
			Проводка.Сумма        = Строка.РазницаПоПереоценке;
			
			
			Проводка.СчетДт = Строка.СчетУчетаБУ;
			УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура", Строка.Номенклатура);
			УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады", Строка.Склад);
			
			Проводка.СчетКт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("8511");
			УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Строка.Номенклатура);
			
		КонецЕсли;
		
		
	КонецЦикла;
	
	
	
	
КонецПроцедуры
 

Функция ПечатьДокумента(ИмяМакета)
	
	Запрос=новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ПереоценкаНеустановленногоОборудованияОборудование.Номенклатура,
	|	ПереоценкаНеустановленногоОборудованияОборудование.Склад КАК Склад,
	|	ПереоценкаНеустановленногоОборудованияОборудование.Стоимость КАК Стоимость,
	|	ПереоценкаНеустановленногоОборудованияОборудование.СтоимостьНовая КАК СтоимостьНовая,
	|	ПереоценкаНеустановленногоОборудованияОборудование.КоэффициентПереоценки,
	|	ПереоценкаНеустановленногоОборудованияОборудование.РазницаПоПереоценке КАК РазницаПоПереоценке,
	|	ПереоценкаНеустановленногоОборудованияОборудование.ДатаПоступления,
	|	ПереоценкаНеустановленногоОборудованияОборудование.СчетУчетаБУ КАК СчетУчетаБУ,
	|	ПереоценкаНеустановленногоОборудованияОборудование.Количество,
	|	ПереоценкаНеустановленногоОборудованияОборудование.Номенклатура.Код КАК КодНоменклатуры,
	|	ВЫБОР
	|		КОГДА ПереоценкаНеустановленногоОборудованияОборудование.Количество <> 0
	|			ТОГДА ПереоценкаНеустановленногоОборудованияОборудование.СтоимостьНовая / ПереоценкаНеустановленногоОборудованияОборудование.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Цена
	|ИЗ
	|	Документ.ПереоценкаНеустановленногоОборудования.Оборудование КАК ПереоценкаНеустановленногоОборудованияОборудование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПереоценкаНеустановленногоОборудования КАК ПереоценкаНеустановленногоОборудования
	|		ПО ПереоценкаНеустановленногоОборудованияОборудование.Ссылка = ПереоценкаНеустановленногоОборудования.Ссылка
	|ГДЕ
	|	ПереоценкаНеустановленногоОборудования.Ссылка = &Ссылка
	|ИТОГИ
	|	СУММА(Стоимость),
	|	СУММА(СтоимостьНовая),
	|	СУММА(РазницаПоПереоценке)
	|ПО
	|	ОБЩИЕ,
	|	Склад,
	|	СчетУчетаБУ";
	
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	результат=Запрос.Выполнить();
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("Макет");
	
	ОбластьИтог = Макет.ПолучитьОбласть("Итог");
	ОбластьСклад = Макет.ПолучитьОбласть("Склад");
	ОбластьСчетУчета = Макет.ПолучитьОбласть("СчетУчета");
	
	
	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Номер=ПолучитьНомерНаПечать(ЭтотОбъект);
	Область.Параметры.Дата=Формат(Дата,"ДФ=dd.MM.yyyy");
	Область.Параметры.Период=Формат(ПериодПереоценки,"ДФ=yyyy")+" г.";
	ТабДок.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Строка");
	
	ВыборкаОбщие=результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаОбщие.Следующий();
	ОбластьИтог.Параметры.Заполнить(ВыборкаОбщие);	
	
	ТабДок.НачатьАвтогруппировкуСтрок();	
	
	ВыборкаСклад=ВыборкаОбщие.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСклад.Следующий() Цикл	
		
		ОбластьСклад.Параметры.Заполнить(ВыборкаСклад);
		ТабДок.Вывести(ОбластьСклад,ВыборкаСклад.Уровень());
		
		ВыборкаСчет=ВыборкаСклад.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСчет.Следующий() Цикл	
			
			ОбластьСчетУчета.Параметры.Заполнить(ВыборкаСчет);
			ТабДок.Вывести(ОбластьСчетУчета,ВыборкаСчет.Уровень());
			
			ВыборкаДетали=ВыборкаСчет.Выбрать();
			Пока ВыборкаДетали.Следующий() Цикл	
				Область.Параметры.Заполнить(ВыборкаДетали);
				ТабДок.Вывести(Область,ВыборкаДетали.Уровень());
			КонецЦикла; 
		КонецЦикла; 
	КонецЦикла; 
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();	
	ТабДок.Вывести(ОбластьИтог);
	
	ТабДок.ПовторятьПриПечатиСтроки=ТабДок.Область(3,0,3);
	ТабДок.Автомасштаб=истина;
	ТабДок.ФиксацияСверху=3;
	ТабДок.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр = Истина;
	
	Возврат ТабДок;

КонецФункции

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	
	ТабДокумент = ПечатьДокумента(ИмяМакета);
		
	НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, "");
	
КонецПроцедуры // Печать()
